// НЕ РАБОТАЕТ
#include <iostream>
/*
минимум 6 функций:
- определение первого хода (возвращает bool) рандомный бросок от 0 до 1
- заполнение массива пробелами
- чистка экарана, затем печать игрового поля после каждого хода (взять символы из игры в кости)
- ф-я отвечающая за ход игрока (ду вайл и проверка свободного места для хода)
- за логику хода компьютера (минимум рандом, а лучше сделать 50/50, всунуть рандом от 1 до 10 и в зависимости от этого
комп ходит либо рандомно либо мешает пользователю, можно поиграться со сложностью, регулирую медиану от 1 до 10), 
проверка на занятость клетки для хода
- проверки на выигрыш после каждого хода игрока и компа
По желанию:
- кто ходит крестиком, а кто ноликом
*/
int main()
{
	const int size{ 3 };
	char arr{ ' ' };

}